-- MySQL dump 10.13  Distrib 8.0.34, for Win64 (x86_64)
--
-- Host: localhost    Database: travel_decision_platform
-- ------------------------------------------------------
-- Server version	8.0.34

/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!50503 SET NAMES utf8mb4 */;
/*!40103 SET @OLD_TIME_ZONE=@@TIME_ZONE */;
/*!40103 SET TIME_ZONE='+00:00' */;
/*!40014 SET @OLD_UNIQUE_CHECKS=@@UNIQUE_CHECKS, UNIQUE_CHECKS=0 */;
/*!40014 SET @OLD_FOREIGN_KEY_CHECKS=@@FOREIGN_KEY_CHECKS, FOREIGN_KEY_CHECKS=0 */;
/*!40101 SET @OLD_SQL_MODE=@@SQL_MODE, SQL_MODE='NO_AUTO_VALUE_ON_ZERO' */;
/*!40111 SET @OLD_SQL_NOTES=@@SQL_NOTES, SQL_NOTES=0 */;

--
-- Table structure for table `ads_destination_recommend_result`
--

DROP TABLE IF EXISTS `ads_destination_recommend_result`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `ads_destination_recommend_result` (
  `id` bigint unsigned NOT NULL AUTO_INCREMENT,
  `request_id` varchar(100) DEFAULT NULL,
  `origin_city` varchar(50) NOT NULL,
  `destination_code` varchar(50) NOT NULL,
  `destination_name` varchar(200) DEFAULT NULL,
  `travel_start_date` date NOT NULL,
  `travel_end_date` date NOT NULL,
  `travel_days` int DEFAULT '1',
  `user_budget` decimal(10,2) DEFAULT '0.00',
  `estimated_total_cost` decimal(10,2) DEFAULT '0.00',
  `traffic_cost` decimal(10,2) DEFAULT '0.00',
  `hotel_cost` decimal(10,2) DEFAULT '0.00',
  `food_cost` decimal(10,2) DEFAULT '0.00',
  `ticket_cost` decimal(10,2) DEFAULT '0.00',
  `scenery_score` decimal(5,2) DEFAULT '0.00',
  `traffic_score` decimal(5,2) DEFAULT '0.00',
  `hotel_score` decimal(5,2) DEFAULT '0.00',
  `weather_score` decimal(5,2) DEFAULT '0.00',
  `cost_score` decimal(5,2) DEFAULT '0.00',
  `crowd_index` decimal(5,2) DEFAULT '0.00',
  `crowd_score` decimal(5,2) DEFAULT '0.00',
  `final_score` decimal(5,2) DEFAULT '0.00',
  `recommend_rank` int DEFAULT '0',
  `recommend_level` varchar(20) DEFAULT 'LOW',
  `recommend_reason` text,
  `model_version` varchar(50) DEFAULT NULL,
  `created_at` datetime NOT NULL DEFAULT CURRENT_TIMESTAMP,
  `updated_at` datetime NOT NULL DEFAULT CURRENT_TIMESTAMP ON UPDATE CURRENT_TIMESTAMP,
  PRIMARY KEY (`id`),
  KEY `idx_query` (`origin_city`,`travel_start_date`,`travel_end_date`)
) ENGINE=InnoDB AUTO_INCREMENT=90 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci COMMENT='推荐结果表';
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `ads_destination_recommend_result`
--

LOCK TABLES `ads_destination_recommend_result` WRITE;
/*!40000 ALTER TABLE `ads_destination_recommend_result` DISABLE KEYS */;
INSERT INTO `ads_destination_recommend_result` VALUES (7,'627b8ce9-9a33-4a66-a31b-3b8aa360e984','北京','DEST006','黄山','2026-07-01','2026-07-05',4,5000.00,3300.00,900.00,1200.00,720.00,480.00,93.00,81.40,75.00,72.80,93.20,62.50,37.50,79.43,1,'MEDIUM','景色评分高，交通较方便，预算内可完成，拥挤程度相对可控','mvp_rule_v1','2026-06-06 19:01:51','2026-06-06 19:01:51'),(8,'d64b9535-b07f-4507-be61-d5a71dd7d856','北京','DEST002','西湖','2026-07-01','2026-07-05',4,5000.00,4380.00,1100.00,2080.00,720.00,480.00,88.00,84.60,88.00,71.00,97.52,79.95,20.05,79.40,2,'MEDIUM','景色评分高，交通较方便，预算内可完成，拥挤程度相对可控','mvp_rule_v1','2026-06-06 19:01:51','2026-06-06 19:01:51'),(9,'04fe8d13-7c43-415e-acab-251558d16f33','北京','DEST001','张家界国家森林公园','2026-07-01','2026-07-05',4,5000.00,4720.00,2400.00,1120.00,720.00,480.00,92.50,79.00,72.00,72.80,98.88,65.05,34.95,78.97,3,'MEDIUM','景色评分高，预算内可完成，拥挤程度相对可控','mvp_rule_v1','2026-06-06 19:01:51','2026-06-06 19:01:51'),(10,'2cfca9ec-c207-492d-af40-0950b3e945e0','北京','DEST003','漓江','2026-07-01','2026-07-05',4,5000.00,4200.00,2000.00,1000.00,720.00,480.00,90.00,76.80,70.00,73.60,96.80,62.05,37.95,77.72,4,'MEDIUM','景色评分高，预算内可完成，拥挤程度相对可控','mvp_rule_v1','2026-06-06 19:01:51','2026-06-06 19:01:51'),(11,'d9b616a9-ab41-41d2-ae9b-313979205dfd','北京','DEST004','布达拉宫','2026-07-01','2026-07-05',4,5000.00,5600.00,3000.00,1400.00,720.00,480.00,95.00,60.20,68.00,87.00,58.00,57.75,42.25,71.96,5,'LOW','景色评分高，预计花费略高于预算，拥挤程度相对可控，天气适宜度较好','mvp_rule_v1','2026-06-06 19:01:51','2026-06-06 19:01:51'),(12,'3b04061f-1030-42fe-bc6a-384d10e238b9','北京','DEST005','亚龙湾','2026-07-01','2026-07-05',4,5000.00,6520.00,2600.00,2720.00,720.00,480.00,85.00,81.40,90.00,77.00,39.60,82.30,17.70,70.29,6,'LOW','交通较方便，预计花费略高于预算，节假日可能较拥挤','mvp_rule_v1','2026-06-06 19:01:51','2026-06-06 19:01:51'),(13,'0bf83c99-9ad3-4382-8c26-95f184769991','北京','DEST006','黄山','2026-07-01','2026-07-05',4,5000.00,2450.00,450.00,1200.00,600.00,200.00,93.00,88.00,75.00,72.80,95.00,80.00,60.00,82.51,1,'MEDIUM','景观评分极高；费用在预算范围内；交通便利','v1.0','2026-06-07 11:29:54','2026-06-07 11:29:54'),(14,'0bf83c99-9ad3-4382-8c26-95f184769991','北京','DEST002','西湖','2026-07-01','2026-07-05',4,5000.00,3430.00,550.00,2080.00,600.00,200.00,88.00,90.00,88.00,71.00,95.00,95.00,52.50,82.40,2,'MEDIUM','费用在预算范围内；交通便利','v1.0','2026-06-07 11:29:54','2026-06-07 11:29:54'),(15,'0bf83c99-9ad3-4382-8c26-95f184769991','北京','DEST001','张家界国家森林公园','2026-07-01','2026-07-05',4,5000.00,3120.00,1200.00,1120.00,600.00,200.00,92.50,82.00,72.00,72.80,95.00,85.00,57.50,80.78,3,'MEDIUM','景观评分极高；费用在预算范围内','v1.0','2026-06-07 11:29:54','2026-06-07 11:29:54'),(16,'0bf83c99-9ad3-4382-8c26-95f184769991','北京','DEST005','亚龙湾','2026-07-01','2026-07-05',4,5000.00,4820.00,1300.00,2720.00,600.00,200.00,85.00,85.00,90.00,77.00,80.00,90.00,55.00,80.40,4,'MEDIUM','费用在预算范围内；交通便利','v1.0','2026-06-07 11:29:54','2026-06-07 11:29:54'),(17,'0bf83c99-9ad3-4382-8c26-95f184769991','北京','DEST003','漓江','2026-07-01','2026-07-05',4,5000.00,2800.00,1000.00,1000.00,600.00,200.00,90.00,80.00,70.00,73.60,95.00,82.00,59.00,79.87,5,'MEDIUM','景观评分极高；费用在预算范围内','v1.0','2026-06-07 11:29:54','2026-06-07 11:29:54'),(18,'0bf83c99-9ad3-4382-8c26-95f184769991','北京','DEST004','布达拉宫','2026-07-01','2026-07-05',4,5000.00,3700.00,1500.00,1400.00,600.00,200.00,95.00,65.00,68.00,87.00,80.00,70.00,65.00,79.60,6,'MEDIUM','景观评分极高；旅行期间天气良好；费用在预算范围内','v1.0','2026-06-07 11:29:54','2026-06-07 11:29:54'),(19,'1ae1ee40-c639-451a-93b2-0c4356acfcfc','北京','DEST006','黄山','2026-07-01','2026-07-05',4,5000.00,2450.00,450.00,1200.00,600.00,200.00,93.00,88.00,75.00,72.80,95.00,80.00,60.00,82.51,1,'MEDIUM','景观评分极高；费用在预算范围内；交通便利','v1.0','2026-06-07 12:58:21','2026-06-07 12:58:21'),(20,'1ae1ee40-c639-451a-93b2-0c4356acfcfc','北京','DEST002','西湖','2026-07-01','2026-07-05',4,5000.00,3430.00,550.00,2080.00,600.00,200.00,88.00,90.00,88.00,71.00,95.00,95.00,52.50,82.40,2,'MEDIUM','费用在预算范围内；交通便利','v1.0','2026-06-07 12:58:21','2026-06-07 12:58:21'),(21,'1ae1ee40-c639-451a-93b2-0c4356acfcfc','北京','DEST001','张家界国家森林公园','2026-07-01','2026-07-05',4,5000.00,3120.00,1200.00,1120.00,600.00,200.00,92.50,82.00,72.00,72.80,95.00,85.00,57.50,80.78,3,'MEDIUM','景观评分极高；费用在预算范围内','v1.0','2026-06-07 12:58:21','2026-06-07 12:58:21'),(22,'1ae1ee40-c639-451a-93b2-0c4356acfcfc','北京','DEST005','亚龙湾','2026-07-01','2026-07-05',4,5000.00,4820.00,1300.00,2720.00,600.00,200.00,85.00,85.00,90.00,77.00,80.00,90.00,55.00,80.40,4,'MEDIUM','费用在预算范围内；交通便利','v1.0','2026-06-07 12:58:21','2026-06-07 12:58:21'),(23,'1ae1ee40-c639-451a-93b2-0c4356acfcfc','北京','DEST003','漓江','2026-07-01','2026-07-05',4,5000.00,2800.00,1000.00,1000.00,600.00,200.00,90.00,80.00,70.00,73.60,95.00,82.00,59.00,79.87,5,'MEDIUM','景观评分极高；费用在预算范围内','v1.0','2026-06-07 12:58:21','2026-06-07 12:58:21'),(24,'1ae1ee40-c639-451a-93b2-0c4356acfcfc','北京','DEST004','布达拉宫','2026-07-01','2026-07-05',4,5000.00,3700.00,1500.00,1400.00,600.00,200.00,95.00,65.00,68.00,87.00,80.00,70.00,65.00,79.60,6,'MEDIUM','景观评分极高；旅行期间天气良好；费用在预算范围内','v1.0','2026-06-07 12:58:21','2026-06-07 12:58:21'),(25,'da1ed144-83a9-4ce6-9516-16f0a7b6273d','北京','DEST006','黄山','2026-07-01','2026-07-05',4,5000.00,2450.00,450.00,1200.00,600.00,200.00,93.00,88.00,75.00,72.80,95.00,80.00,60.00,82.51,1,'MEDIUM','景观评分极高；费用在预算范围内；交通便利','v1.0','2026-06-07 13:09:46','2026-06-07 13:09:46'),(26,'da1ed144-83a9-4ce6-9516-16f0a7b6273d','北京','DEST002','西湖','2026-07-01','2026-07-05',4,5000.00,3430.00,550.00,2080.00,600.00,200.00,88.00,90.00,88.00,71.00,95.00,95.00,52.50,82.40,2,'MEDIUM','费用在预算范围内；交通便利','v1.0','2026-06-07 13:09:46','2026-06-07 13:09:46'),(27,'da1ed144-83a9-4ce6-9516-16f0a7b6273d','北京','DEST001','张家界国家森林公园','2026-07-01','2026-07-05',4,5000.00,3120.00,1200.00,1120.00,600.00,200.00,92.50,82.00,72.00,72.80,95.00,85.00,57.50,80.78,3,'MEDIUM','景观评分极高；费用在预算范围内','v1.0','2026-06-07 13:09:46','2026-06-07 13:09:46'),(28,'da1ed144-83a9-4ce6-9516-16f0a7b6273d','北京','DEST005','亚龙湾','2026-07-01','2026-07-05',4,5000.00,4820.00,1300.00,2720.00,600.00,200.00,85.00,85.00,90.00,77.00,80.00,90.00,55.00,80.40,4,'MEDIUM','费用在预算范围内；交通便利','v1.0','2026-06-07 13:09:46','2026-06-07 13:09:46'),(29,'da1ed144-83a9-4ce6-9516-16f0a7b6273d','北京','DEST003','漓江','2026-07-01','2026-07-05',4,5000.00,2800.00,1000.00,1000.00,600.00,200.00,90.00,80.00,70.00,73.60,95.00,82.00,59.00,79.87,5,'MEDIUM','景观评分极高；费用在预算范围内','v1.0','2026-06-07 13:09:46','2026-06-07 13:09:46'),(30,'da1ed144-83a9-4ce6-9516-16f0a7b6273d','北京','DEST004','布达拉宫','2026-07-01','2026-07-05',4,5000.00,3700.00,1500.00,1400.00,600.00,200.00,95.00,65.00,68.00,87.00,80.00,70.00,65.00,79.60,6,'MEDIUM','景观评分极高；旅行期间天气良好；费用在预算范围内','v1.0','2026-06-07 13:09:46','2026-06-07 13:09:46'),(31,'2158ef5d-9ab1-4843-b648-207be90f7690','北京','DEST006','黄山','2026-07-01','2026-07-05',4,5000.00,2450.00,450.00,1200.00,600.00,200.00,93.00,88.00,75.00,72.80,95.00,80.00,60.00,82.51,1,'MEDIUM','景观评分极高；费用在预算范围内；交通便利','v1.0','2026-06-07 13:12:00','2026-06-07 13:12:00'),(32,'2158ef5d-9ab1-4843-b648-207be90f7690','北京','DEST002','西湖','2026-07-01','2026-07-05',4,5000.00,3430.00,550.00,2080.00,600.00,200.00,88.00,90.00,88.00,71.00,95.00,95.00,52.50,82.40,2,'MEDIUM','费用在预算范围内；交通便利','v1.0','2026-06-07 13:12:00','2026-06-07 13:12:00'),(33,'2158ef5d-9ab1-4843-b648-207be90f7690','北京','DEST001','张家界国家森林公园','2026-07-01','2026-07-05',4,5000.00,3120.00,1200.00,1120.00,600.00,200.00,92.50,82.00,72.00,72.80,95.00,85.00,57.50,80.78,3,'MEDIUM','景观评分极高；费用在预算范围内','v1.0','2026-06-07 13:12:00','2026-06-07 13:12:00'),(34,'2158ef5d-9ab1-4843-b648-207be90f7690','北京','DEST005','亚龙湾','2026-07-01','2026-07-05',4,5000.00,4820.00,1300.00,2720.00,600.00,200.00,85.00,85.00,90.00,77.00,80.00,90.00,55.00,80.40,4,'MEDIUM','费用在预算范围内；交通便利','v1.0','2026-06-07 13:12:00','2026-06-07 13:12:00'),(35,'2158ef5d-9ab1-4843-b648-207be90f7690','北京','DEST003','漓江','2026-07-01','2026-07-05',4,5000.00,2800.00,1000.00,1000.00,600.00,200.00,90.00,80.00,70.00,73.60,95.00,82.00,59.00,79.87,5,'MEDIUM','景观评分极高；费用在预算范围内','v1.0','2026-06-07 13:12:00','2026-06-07 13:12:00'),(36,'2158ef5d-9ab1-4843-b648-207be90f7690','北京','DEST004','布达拉宫','2026-07-01','2026-07-05',4,5000.00,3700.00,1500.00,1400.00,600.00,200.00,95.00,65.00,68.00,87.00,80.00,70.00,65.00,79.60,6,'MEDIUM','景观评分极高；旅行期间天气良好；费用在预算范围内','v1.0','2026-06-07 13:12:00','2026-06-07 13:12:00'),(37,'ab3e2e4a-34d9-43d1-9d97-b8fd3f4a83ab','北京','DEST006','黄山','2026-07-01','2026-07-05',4,5000.00,2450.00,450.00,1200.00,600.00,200.00,93.00,88.00,75.00,72.80,95.00,80.00,60.00,82.51,1,'MEDIUM','景观评分极高；费用在预算范围内；交通便利','v1.0','2026-06-07 13:12:26','2026-06-07 13:12:26'),(38,'ab3e2e4a-34d9-43d1-9d97-b8fd3f4a83ab','北京','DEST002','西湖','2026-07-01','2026-07-05',4,5000.00,3430.00,550.00,2080.00,600.00,200.00,88.00,90.00,88.00,71.00,95.00,95.00,52.50,82.40,2,'MEDIUM','费用在预算范围内；交通便利','v1.0','2026-06-07 13:12:26','2026-06-07 13:12:26'),(39,'ab3e2e4a-34d9-43d1-9d97-b8fd3f4a83ab','北京','DEST001','张家界国家森林公园','2026-07-01','2026-07-05',4,5000.00,3120.00,1200.00,1120.00,600.00,200.00,92.50,82.00,72.00,72.80,95.00,85.00,57.50,80.78,3,'MEDIUM','景观评分极高；费用在预算范围内','v1.0','2026-06-07 13:12:26','2026-06-07 13:12:26'),(40,'ab3e2e4a-34d9-43d1-9d97-b8fd3f4a83ab','北京','DEST005','亚龙湾','2026-07-01','2026-07-05',4,5000.00,4820.00,1300.00,2720.00,600.00,200.00,85.00,85.00,90.00,77.00,80.00,90.00,55.00,80.40,4,'MEDIUM','费用在预算范围内；交通便利','v1.0','2026-06-07 13:12:26','2026-06-07 13:12:26'),(41,'ab3e2e4a-34d9-43d1-9d97-b8fd3f4a83ab','北京','DEST003','漓江','2026-07-01','2026-07-05',4,5000.00,2800.00,1000.00,1000.00,600.00,200.00,90.00,80.00,70.00,73.60,95.00,82.00,59.00,79.87,5,'MEDIUM','景观评分极高；费用在预算范围内','v1.0','2026-06-07 13:12:26','2026-06-07 13:12:26'),(42,'ab3e2e4a-34d9-43d1-9d97-b8fd3f4a83ab','北京','DEST004','布达拉宫','2026-07-01','2026-07-05',4,5000.00,3700.00,1500.00,1400.00,600.00,200.00,95.00,65.00,68.00,87.00,80.00,70.00,65.00,79.60,6,'MEDIUM','景观评分极高；旅行期间天气良好；费用在预算范围内','v1.0','2026-06-07 13:12:26','2026-06-07 13:12:26'),(43,'0e997c21-788e-4a44-98e6-d3f27d6bd86e','北京','DEST006','黄山','2026-07-01','2026-07-05',4,5000.00,2450.00,450.00,1200.00,600.00,200.00,93.00,88.00,75.00,72.80,95.00,80.00,60.00,82.51,1,'MEDIUM','景观评分极高；费用在预算范围内；交通便利','v1.0','2026-06-07 13:12:52','2026-06-07 13:12:52'),(44,'0e997c21-788e-4a44-98e6-d3f27d6bd86e','北京','DEST002','西湖','2026-07-01','2026-07-05',4,5000.00,3430.00,550.00,2080.00,600.00,200.00,88.00,90.00,88.00,71.00,95.00,95.00,52.50,82.40,2,'MEDIUM','费用在预算范围内；交通便利','v1.0','2026-06-07 13:12:52','2026-06-07 13:12:52'),(45,'0e997c21-788e-4a44-98e6-d3f27d6bd86e','北京','DEST001','张家界国家森林公园','2026-07-01','2026-07-05',4,5000.00,3120.00,1200.00,1120.00,600.00,200.00,92.50,82.00,72.00,72.80,95.00,85.00,57.50,80.78,3,'MEDIUM','景观评分极高；费用在预算范围内','v1.0','2026-06-07 13:12:52','2026-06-07 13:12:52'),(46,'0e997c21-788e-4a44-98e6-d3f27d6bd86e','北京','DEST005','亚龙湾','2026-07-01','2026-07-05',4,5000.00,4820.00,1300.00,2720.00,600.00,200.00,85.00,85.00,90.00,77.00,80.00,90.00,55.00,80.40,4,'MEDIUM','费用在预算范围内；交通便利','v1.0','2026-06-07 13:12:52','2026-06-07 13:12:52'),(47,'0e997c21-788e-4a44-98e6-d3f27d6bd86e','北京','DEST003','漓江','2026-07-01','2026-07-05',4,5000.00,2800.00,1000.00,1000.00,600.00,200.00,90.00,80.00,70.00,73.60,95.00,82.00,59.00,79.87,5,'MEDIUM','景观评分极高；费用在预算范围内','v1.0','2026-06-07 13:12:52','2026-06-07 13:12:52'),(48,'0e997c21-788e-4a44-98e6-d3f27d6bd86e','北京','DEST004','布达拉宫','2026-07-01','2026-07-05',4,5000.00,3700.00,1500.00,1400.00,600.00,200.00,95.00,65.00,68.00,87.00,80.00,70.00,65.00,79.60,6,'MEDIUM','景观评分极高；旅行期间天气良好；费用在预算范围内','v1.0','2026-06-07 13:12:52','2026-06-07 13:12:52'),(49,'22e281be-cec3-437c-93a9-9eaf2c051f56','北京','DEST006','黄山','2026-07-01','2026-07-05',4,5000.00,3248.00,608.00,1840.00,600.00,200.00,93.00,17.00,87.56,60.00,95.00,80.00,60.00,71.18,1,'MEDIUM','景观评分极高；费用在预算范围内','v3.0','2026-06-08 17:11:17','2026-06-08 17:11:17'),(50,'22e281be-cec3-437c-93a9-9eaf2c051f56','北京','DEST003','漓江','2026-07-01','2026-07-05',4,5000.00,3530.50,654.50,2076.00,600.00,200.00,90.00,0.00,93.61,73.60,80.00,82.00,59.00,69.16,2,'LOW','景观评分极高；费用在预算范围内','v3.0','2026-06-08 17:11:17','2026-06-08 17:11:17'),(51,'22e281be-cec3-437c-93a9-9eaf2c051f56','北京','DEST001','张家界国家森林公园','2026-07-01','2026-07-05',4,5000.00,3813.00,901.00,2112.00,600.00,200.00,92.50,0.00,90.55,60.00,80.00,85.00,57.50,66.46,3,'LOW','景观评分极高；费用在预算范围内','v3.0','2026-06-08 17:11:17','2026-06-08 17:11:17'),(52,'22e281be-cec3-437c-93a9-9eaf2c051f56','北京','DEST004','布达拉宫','2026-07-01','2026-07-05',4,5000.00,3944.00,924.00,2220.00,600.00,200.00,95.00,0.00,79.77,60.00,80.00,70.00,65.00,66.22,4,'LOW','景观评分极高；费用在预算范围内','v3.0','2026-06-08 17:11:17','2026-06-08 17:11:17'),(53,'REQ_2026-07-01_上海_9e94f2c2','上海','DEST002','西湖','2026-07-01','2026-07-05',4,6000.00,3399.00,71.00,2528.00,600.00,200.00,88.00,65.50,96.72,60.00,95.00,95.00,52.50,77.83,1,'MEDIUM','费用在预算范围内','v3.0','2026-06-08 18:14:37','2026-06-08 18:14:37'),(54,'REQ_2026-07-01_上海_9e94f2c2','上海','DEST006','黄山','2026-07-01','2026-07-05',4,6000.00,2852.00,212.00,1840.00,600.00,200.00,93.00,55.67,89.92,60.00,95.00,80.00,60.00,77.34,2,'MEDIUM','景观评分极高；费用在预算范围内','v3.0','2026-06-08 18:14:37','2026-06-08 18:14:37'),(55,'REQ_2026-07-01_上海_9e94f2c2','上海','DEST003','漓江','2026-07-01','2026-07-05',4,6000.00,3643.50,767.50,2076.00,600.00,200.00,90.00,10.00,90.52,60.00,95.00,82.00,59.00,69.73,3,'LOW','景观评分极高；费用在预算范围内','v3.0','2026-06-08 18:14:37','2026-06-08 18:14:37'),(56,'REQ_2026-07-01_上海_9e94f2c2','上海','DEST001','张家界国家森林公园','2026-07-01','2026-07-05',4,6000.00,3705.00,793.00,2112.00,600.00,200.00,92.50,7.17,84.29,60.00,95.00,85.00,57.50,68.84,4,'LOW','景观评分极高；费用在预算范围内','v3.0','2026-06-08 18:14:37','2026-06-08 18:14:37'),(57,'REQ_2026-07-01_上海_9e94f2c2','上海','DEST004','布达拉宫','2026-07-01','2026-07-05',4,6000.00,4273.00,1253.00,2220.00,600.00,200.00,95.00,0.00,78.15,60.00,80.00,70.00,65.00,65.97,5,'LOW','景观评分极高；费用在预算范围内','v3.0','2026-06-08 18:14:37','2026-06-08 18:14:37'),(58,'REQ_2026-07-01_上海_9e94f2c2','上海','DEST005','亚龙湾','2026-07-01','2026-07-05',4,6000.00,4966.50,1094.50,3072.00,600.00,200.00,85.00,0.00,96.28,60.00,80.00,90.00,55.00,65.19,6,'LOW','费用在预算范围内','v3.0','2026-06-08 18:14:37','2026-06-08 18:14:37'),(59,'REQ_2026-07-01_上海_a7a1c77d','上海','DEST002','西湖','2026-07-01','2026-07-05',4,6000.00,3399.00,71.00,2528.00,600.00,200.00,88.00,65.50,94.03,60.00,95.00,95.00,52.50,77.43,1,'MEDIUM','费用在预算范围内','v3.0','2026-06-08 18:15:40','2026-06-08 18:15:40'),(60,'REQ_2026-07-01_上海_a7a1c77d','上海','DEST006','黄山','2026-07-01','2026-07-05',4,6000.00,2852.00,212.00,1840.00,600.00,200.00,93.00,55.67,86.62,60.00,95.00,80.00,60.00,76.84,2,'MEDIUM','景观评分极高；费用在预算范围内','v3.0','2026-06-08 18:15:40','2026-06-08 18:15:40'),(61,'REQ_2026-07-01_上海_a7a1c77d','上海','DEST003','漓江','2026-07-01','2026-07-05',4,6000.00,3643.50,767.50,2076.00,600.00,200.00,90.00,10.00,86.76,60.00,95.00,82.00,59.00,69.16,3,'LOW','景观评分极高；费用在预算范围内','v3.0','2026-06-08 18:15:40','2026-06-08 18:15:40'),(62,'REQ_2026-07-01_上海_a7a1c77d','上海','DEST001','张家界国家森林公园','2026-07-01','2026-07-05',4,6000.00,3705.00,793.00,2112.00,600.00,200.00,92.50,7.17,81.93,60.00,95.00,85.00,57.50,68.49,4,'LOW','景观评分极高；费用在预算范围内','v3.0','2026-06-08 18:15:40','2026-06-08 18:15:40'),(63,'REQ_2026-07-01_上海_a7a1c77d','上海','DEST004','布达拉宫','2026-07-01','2026-07-05',4,6000.00,4273.00,1253.00,2220.00,600.00,200.00,95.00,0.00,90.20,60.00,80.00,70.00,65.00,67.78,5,'LOW','景观评分极高；费用在预算范围内','v3.0','2026-06-08 18:15:40','2026-06-08 18:15:40'),(64,'REQ_2026-07-01_上海_a7a1c77d','上海','DEST005','亚龙湾','2026-07-01','2026-07-05',4,6000.00,4966.50,1094.50,3072.00,600.00,200.00,85.00,0.00,97.22,60.00,80.00,90.00,55.00,65.33,6,'LOW','费用在预算范围内','v3.0','2026-06-08 18:15:40','2026-06-08 18:15:40'),(65,'REQ_20260701_3f137d74','上海','DEST002','西湖','2026-07-01','2026-07-05',4,6000.00,3399.00,71.00,2528.00,600.00,200.00,88.00,65.50,92.31,60.00,95.00,95.00,52.50,77.17,1,'MEDIUM','费用在预算范围内','v3.0','2026-06-08 18:17:54','2026-06-08 18:17:54'),(66,'REQ_20260701_3f137d74','上海','DEST006','黄山','2026-07-01','2026-07-05',4,6000.00,2852.00,212.00,1840.00,600.00,200.00,93.00,55.67,85.31,60.00,95.00,80.00,60.00,76.65,2,'MEDIUM','景观评分极高；费用在预算范围内','v3.0','2026-06-08 18:17:54','2026-06-08 18:17:54'),(67,'REQ_20260701_3f137d74','上海','DEST001','张家界国家森林公园','2026-07-01','2026-07-05',4,6000.00,3705.00,793.00,2112.00,600.00,200.00,92.50,7.17,92.37,60.00,95.00,85.00,57.50,70.06,3,'MEDIUM','景观评分极高；费用在预算范围内','v3.0','2026-06-08 18:17:54','2026-06-08 18:17:54'),(68,'REQ_20260701_3f137d74','上海','DEST003','漓江','2026-07-01','2026-07-05',4,6000.00,3643.50,767.50,2076.00,600.00,200.00,90.00,10.00,91.21,60.00,95.00,82.00,59.00,69.83,4,'LOW','景观评分极高；费用在预算范围内','v3.0','2026-06-08 18:17:54','2026-06-08 18:17:54'),(69,'REQ_20260701_3f137d74','上海','DEST004','布达拉宫','2026-07-01','2026-07-05',4,6000.00,4273.00,1253.00,2220.00,600.00,200.00,95.00,0.00,86.90,60.00,80.00,70.00,65.00,67.28,5,'LOW','景观评分极高；费用在预算范围内','v3.0','2026-06-08 18:17:54','2026-06-08 18:17:54'),(70,'REQ_20260701_3f137d74','上海','DEST005','亚龙湾','2026-07-01','2026-07-05',4,6000.00,4966.50,1094.50,3072.00,600.00,200.00,85.00,0.00,98.56,60.00,80.00,90.00,55.00,65.53,6,'LOW','费用在预算范围内','v3.0','2026-06-08 18:17:54','2026-06-08 18:17:54'),(71,'REQ_20260701_668118e9','上海','DEST002','西湖','2026-07-01','2026-07-05',4,6000.00,3399.00,71.00,2528.00,600.00,200.00,88.00,65.50,99.86,60.00,95.00,95.00,52.50,78.30,1,'MEDIUM','费用在预算范围内','v3.0','2026-06-08 18:21:34','2026-06-08 18:21:34'),(72,'REQ_20260701_668118e9','上海','DEST001','张家界国家森林公园','2026-07-01','2026-07-05',4,6000.00,3705.00,793.00,2112.00,600.00,200.00,92.50,7.17,90.45,60.00,95.00,85.00,57.50,69.77,2,'LOW','景观评分极高；费用在预算范围内','v3.0','2026-06-08 18:21:34','2026-06-08 18:21:34'),(73,'REQ_20260701_668118e9','上海','DEST005','亚龙湾','2026-07-01','2026-07-05',4,6000.00,4966.50,1094.50,3072.00,600.00,200.00,85.00,0.00,86.62,60.00,80.00,90.00,55.00,63.74,3,'LOW','费用在预算范围内','v3.0','2026-06-08 18:21:34','2026-06-08 18:21:34'),(74,'REQ_20260603_ab29f3af','北京','DEST006','黄山','2026-06-03','2026-06-16',13,5000.00,8738.00,608.00,5980.00,1950.00,200.00,93.00,17.00,87.25,72.50,62.62,80.00,60.00,68.78,1,'LOW','景观评分极高','v3.0','2026-06-08 18:24:17','2026-06-08 18:24:17'),(75,'REQ_20260603_ab29f3af','北京','DEST002','西湖','2026-06-03','2026-06-16',13,5000.00,10978.00,612.00,8216.00,1950.00,200.00,88.00,18.17,97.44,87.50,40.22,95.00,52.50,68.12,2,'LOW','天气数据来自高德天气查询 API，旅行期间天气良好','v3.0','2026-06-08 18:24:17','2026-06-08 18:24:17'),(76,'REQ_20260603_ab29f3af','北京','DEST004','布达拉宫','2026-06-03','2026-06-16',13,5000.00,10289.00,924.00,7215.00,1950.00,200.00,95.00,0.00,85.31,81.25,47.11,70.00,65.00,66.36,3,'LOW','景观评分极高；天气数据来自高德天气查询 API，旅行期间天气良好','v3.0','2026-06-08 18:24:17','2026-06-08 18:24:17'),(77,'REQ_20260603_ab29f3af','北京','DEST003','漓江','2026-06-03','2026-06-16',13,5000.00,9551.50,654.50,6747.00,1950.00,200.00,90.00,0.00,89.35,73.75,54.48,82.00,59.00,64.73,4,'LOW','景观评分极高','v3.0','2026-06-08 18:24:17','2026-06-08 18:24:17'),(78,'REQ_20260603_ab29f3af','北京','DEST001','张家界国家森林公园','2026-06-03','2026-06-16',13,5000.00,9915.00,901.00,6864.00,1950.00,200.00,92.50,0.00,89.23,66.25,50.85,85.00,57.50,63.14,5,'LOW','景观评分极高','v3.0','2026-06-08 18:24:17','2026-06-08 18:24:17'),(79,'REQ_20260611_2718e124','成都','DEST001','张家界国家森林公园','2026-06-11','2026-06-16',5,5000.00,4012.00,422.00,2640.00,750.00,200.00,92.50,31.33,87.94,55.00,80.00,85.00,57.50,69.77,1,'LOW','景观评分极高；费用在预算范围内','v3.0','2026-06-08 18:24:46','2026-06-08 18:24:46'),(80,'REQ_20260611_2718e124','成都','DEST004','布达拉宫','2026-06-11','2026-06-16',5,5000.00,4033.50,308.50,2775.00,750.00,200.00,95.00,0.00,88.25,70.00,80.00,70.00,65.00,69.49,2,'LOW','景观评分极高；费用在预算范围内','v3.0','2026-06-08 18:24:46','2026-06-08 18:24:46'),(81,'REQ_20260611_2718e124','成都','DEST006','黄山','2026-06-11','2026-06-16',5,5000.00,4218.00,968.00,2300.00,750.00,200.00,93.00,0.00,86.10,70.00,80.00,80.00,60.00,68.16,3,'LOW','景观评分极高；费用在预算范围内','v3.0','2026-06-08 18:24:46','2026-06-08 18:24:46'),(82,'REQ_20260611_2718e124','成都','DEST005','亚龙湾','2026-06-11','2026-06-16',5,5000.00,5811.00,1021.00,3840.00,750.00,200.00,85.00,0.00,87.01,55.00,60.00,90.00,55.00,59.80,4,'LOW','综合评分一般','v3.0','2026-06-08 18:24:46','2026-06-08 18:24:46'),(83,'REQ_20260610_4e7335d2','上海','DEST002','西湖','2026-06-10','2026-06-16',6,20000.00,4963.00,71.00,3792.00,900.00,200.00,88.00,65.50,90.37,90.00,95.00,95.00,52.50,82.88,1,'MEDIUM','天气数据来自高德天气查询 API，旅行期间天气良好；费用在预算范围内','v3.0','2026-06-08 18:32:48','2026-06-08 18:32:48'),(84,'REQ_20260610_4e7335d2','上海','DEST006','黄山','2026-06-10','2026-06-16',6,20000.00,4072.00,212.00,2760.00,900.00,200.00,93.00,55.67,95.22,82.50,95.00,80.00,60.00,82.63,2,'MEDIUM','景观评分极高；天气数据来自高德天气查询 API，旅行期间天气良好；费用在预算范围内','v3.0','2026-06-08 18:32:48','2026-06-08 18:32:48'),(85,'REQ_20260610_4e7335d2','上海','DEST007','桂林','2026-06-10','2026-06-16',6,20000.00,4915.50,767.50,3048.00,900.00,200.00,92.00,10.33,94.70,85.00,95.00,75.00,62.50,76.25,3,'MEDIUM','景观评分极高；天气数据来自高德天气查询 API，旅行期间天气良好；费用在预算范围内','v3.0','2026-06-08 18:32:48','2026-06-08 18:32:48'),(86,'REQ_20260610_4e7335d2','上海','DEST003','漓江','2026-06-10','2026-06-16',6,20000.00,4981.50,767.50,3114.00,900.00,200.00,90.00,10.00,81.84,85.00,95.00,82.00,59.00,73.43,4,'MEDIUM','景观评分极高；天气数据来自高德天气查询 API，旅行期间天气良好；费用在预算范围内','v3.0','2026-06-08 18:32:48','2026-06-08 18:32:48'),(87,'REQ_20260610_4e7335d2','上海','DEST004','布达拉宫','2026-06-10','2026-06-16',6,20000.00,5683.00,1253.00,3330.00,900.00,200.00,95.00,0.00,84.53,77.50,95.00,70.00,65.00,72.68,5,'MEDIUM','景观评分极高；费用在预算范围内','v3.0','2026-06-08 18:32:48','2026-06-08 18:32:48'),(88,'REQ_20260610_4e7335d2','上海','DEST001','张家界国家森林公园','2026-06-10','2026-06-16',6,20000.00,5061.00,793.00,3168.00,900.00,200.00,92.50,7.17,85.69,70.00,95.00,85.00,57.50,71.05,6,'MEDIUM','景观评分极高；费用在预算范围内','v3.0','2026-06-08 18:32:48','2026-06-08 18:32:48'),(89,'REQ_20260610_4e7335d2','上海','DEST005','亚龙湾','2026-06-10','2026-06-16',6,20000.00,6802.50,1094.50,4608.00,900.00,200.00,85.00,0.00,86.36,55.00,95.00,90.00,55.00,64.95,7,'LOW','费用在预算范围内','v3.0','2026-06-08 18:32:48','2026-06-08 18:32:48');
/*!40000 ALTER TABLE `ads_destination_recommend_result` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `data_quality_check_result`
--

DROP TABLE IF EXISTS `data_quality_check_result`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `data_quality_check_result` (
  `id` bigint unsigned NOT NULL AUTO_INCREMENT,
  `table_name` varchar(200) NOT NULL,
  `rule_name` varchar(200) NOT NULL,
  `rule_desc` varchar(500) DEFAULT NULL,
  `check_result` varchar(20) NOT NULL COMMENT 'PASS/WARNING/FAILED',
  `error_count` int DEFAULT '0',
  `check_time` datetime NOT NULL,
  `error_message` text,
  `created_at` datetime NOT NULL DEFAULT CURRENT_TIMESTAMP,
  PRIMARY KEY (`id`),
  KEY `idx_check_time` (`check_time`)
) ENGINE=InnoDB AUTO_INCREMENT=45 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci COMMENT='数据质量检查结果';
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `data_quality_check_result`
--

LOCK TABLES `data_quality_check_result` WRITE;
/*!40000 ALTER TABLE `data_quality_check_result` DISABLE KEYS */;
INSERT INTO `data_quality_check_result` VALUES (1,'dwd_destination','destination_code_not_null','目的地编码不能为空','PASS',0,'2026-06-07 12:57:40',NULL,'2026-06-07 12:57:40'),(2,'dwd_destination','destination_code_not_null','目的地编码不能为空','PASS',0,'2026-06-07 12:58:20',NULL,'2026-06-07 12:58:20'),(3,'dwd_destination','destination_code_not_null','目的地编码不能为空','PASS',0,'2026-06-07 12:59:10',NULL,'2026-06-07 12:59:09'),(4,'dwd_hotel_price_detail','hotel_price_valid','酒店价格不能小于0','PASS',0,'2026-06-07 12:59:10',NULL,'2026-06-07 12:59:09'),(5,'dwd_weather_detail','weather_score_range','天气评分必须在0到100之间','PASS',0,'2026-06-07 12:59:10',NULL,'2026-06-07 12:59:09'),(6,'ads_destination_recommend_result','final_score_range','推荐综合评分必须在0到100之间','PASS',0,'2026-06-07 12:59:10',NULL,'2026-06-07 12:59:09'),(7,'dwd_destination','destination_code_not_null','目的地编码不能为空','PASS',0,'2026-06-07 13:09:00',NULL,'2026-06-07 13:09:00'),(8,'dwd_hotel_price_detail','hotel_price_valid','酒店价格不能小于0','PASS',0,'2026-06-07 13:09:00',NULL,'2026-06-07 13:09:00'),(9,'dwd_weather_detail','weather_score_range','天气评分必须在0到100之间','PASS',0,'2026-06-07 13:09:00',NULL,'2026-06-07 13:09:00'),(10,'ads_destination_recommend_result','final_score_range','推荐综合评分必须在0到100之间','PASS',0,'2026-06-07 13:09:00',NULL,'2026-06-07 13:09:00'),(11,'dwd_destination','destination_code_not_null','目的地编码不能为空','PASS',0,'2026-06-07 13:11:59',NULL,'2026-06-07 13:11:59'),(12,'dwd_hotel_price_detail','hotel_price_valid','酒店价格不能小于0','PASS',0,'2026-06-07 13:11:59',NULL,'2026-06-07 13:11:59'),(13,'dwd_weather_detail','weather_score_range','天气评分必须在0到100之间','PASS',0,'2026-06-07 13:11:59',NULL,'2026-06-07 13:11:59'),(14,'ads_destination_recommend_result','final_score_range','推荐综合评分必须在0到100之间','PASS',0,'2026-06-07 13:11:59',NULL,'2026-06-07 13:11:59'),(15,'dwd_destination','destination_code_not_null','目的地编码不能为空','PASS',0,'2026-06-07 13:12:22',NULL,'2026-06-07 13:12:21'),(16,'dwd_hotel_price_detail','hotel_price_valid','酒店价格不能小于0','PASS',0,'2026-06-07 13:12:22',NULL,'2026-06-07 13:12:21'),(17,'dwd_weather_detail','weather_score_range','天气评分必须在0到100之间','PASS',0,'2026-06-07 13:12:22',NULL,'2026-06-07 13:12:21'),(18,'ads_destination_recommend_result','final_score_range','推荐综合评分必须在0到100之间','PASS',0,'2026-06-07 13:12:22',NULL,'2026-06-07 13:12:21'),(19,'dwd_destination','destination_code_not_null','目的地编码不能为空','PASS',0,'2026-06-07 13:12:22',NULL,'2026-06-07 13:12:21'),(20,'dwd_hotel_price_detail','hotel_price_valid','酒店价格不能小于0','PASS',0,'2026-06-07 13:12:22',NULL,'2026-06-07 13:12:21'),(21,'dwd_weather_detail','weather_score_range','天气评分必须在0到100之间','PASS',0,'2026-06-07 13:12:22',NULL,'2026-06-07 13:12:21'),(22,'ads_destination_recommend_result','final_score_range','推荐综合评分必须在0到100之间','PASS',0,'2026-06-07 13:12:22',NULL,'2026-06-07 13:12:21'),(23,'dwd_destination','destination_code_not_null','目的地编码不能为空','PASS',0,'2026-06-07 13:12:22',NULL,'2026-06-07 13:12:21'),(24,'dwd_hotel_price_detail','hotel_price_valid','酒店价格不能小于0','PASS',0,'2026-06-07 13:12:22',NULL,'2026-06-07 13:12:21'),(25,'dwd_weather_detail','weather_score_range','天气评分必须在0到100之间','PASS',0,'2026-06-07 13:12:22',NULL,'2026-06-07 13:12:21'),(26,'ads_destination_recommend_result','final_score_range','推荐综合评分必须在0到100之间','PASS',0,'2026-06-07 13:12:22',NULL,'2026-06-07 13:12:21'),(27,'dwd_destination','destination_code_not_null','目的地编码不能为空','PASS',0,'2026-06-08 17:15:31',NULL,'2026-06-08 17:15:30'),(28,'dwd_hotel_price_detail','hotel_price_valid','酒店价格不能小于0','PASS',0,'2026-06-08 17:15:31',NULL,'2026-06-08 17:15:30'),(29,'dwd_weather_detail','weather_score_range','天气评分必须在0到100之间','PASS',0,'2026-06-08 17:15:31',NULL,'2026-06-08 17:15:30'),(30,'ads_destination_recommend_result','final_score_range','推荐综合评分必须在0到100之间','PASS',0,'2026-06-08 17:15:31',NULL,'2026-06-08 17:15:30'),(31,'dwd_destination','destination_location_not_null','目的地经纬度不能为空','PASS',0,'2026-06-08 17:15:31',NULL,'2026-06-08 17:15:30'),(32,'dwd_destination','destination_adcode_not_null','目的地 amap_adcode 不能为空','PASS',0,'2026-06-08 17:15:31',NULL,'2026-06-08 17:15:30'),(33,'dwd_weather_detail','weather_data_source_valid','天气数据 data_source 必须是 amap_weather','PASS',0,'2026-06-08 17:15:31',NULL,'2026-06-08 17:15:30'),(34,'dwd_route_detail','route_data_source_valid','路线数据 data_source 必须是 amap_route','PASS',0,'2026-06-08 17:15:31',NULL,'2026-06-08 17:15:30'),(35,'dwd_route_detail','route_distance_duration_valid','路线距离和耗时必须大于0','PASS',0,'2026-06-08 17:15:31',NULL,'2026-06-08 17:15:30'),(36,'dwd_destination','destination_code_not_null','目的地编码不能为空','PASS',0,'2026-06-08 18:33:34',NULL,'2026-06-08 18:33:33'),(37,'dwd_hotel_price_detail','hotel_price_valid','酒店价格不能小于0','PASS',0,'2026-06-08 18:33:34',NULL,'2026-06-08 18:33:33'),(38,'dwd_weather_detail','weather_score_range','天气评分必须在0到100之间','PASS',0,'2026-06-08 18:33:34',NULL,'2026-06-08 18:33:33'),(39,'ads_destination_recommend_result','final_score_range','推荐综合评分必须在0到100之间','PASS',0,'2026-06-08 18:33:34',NULL,'2026-06-08 18:33:33'),(40,'dwd_destination','destination_location_not_null','目的地经纬度不能为空','PASS',0,'2026-06-08 18:33:34',NULL,'2026-06-08 18:33:33'),(41,'dwd_destination','destination_adcode_not_null','目的地 amap_adcode 不能为空','PASS',0,'2026-06-08 18:33:34',NULL,'2026-06-08 18:33:33'),(42,'dwd_weather_detail','weather_data_source_valid','天气数据 data_source 必须是 amap_weather','PASS',0,'2026-06-08 18:33:34',NULL,'2026-06-08 18:33:33'),(43,'dwd_route_detail','route_data_source_valid','路线数据 data_source 必须是 amap_route','PASS',0,'2026-06-08 18:33:34',NULL,'2026-06-08 18:33:33'),(44,'dwd_route_detail','route_distance_duration_valid','路线距离和耗时必须大于0','PASS',0,'2026-06-08 18:33:34',NULL,'2026-06-08 18:33:33');
/*!40000 ALTER TABLE `data_quality_check_result` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `dwd_city_location`
--

DROP TABLE IF EXISTS `dwd_city_location`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `dwd_city_location` (
  `id` bigint NOT NULL AUTO_INCREMENT COMMENT '涓婚敭ID',
  `city_code` varchar(50) NOT NULL COMMENT '鍩庡競缂栫爜',
  `city_name` varchar(100) NOT NULL COMMENT '鍩庡競鍚嶇О',
  `province` varchar(100) DEFAULT NULL COMMENT '鐪佷唤',
  `amap_adcode` varchar(20) DEFAULT NULL COMMENT '楂樺痉琛屾斂鍖篴dcode',
  `amap_citycode` varchar(20) DEFAULT NULL COMMENT '楂樺痉citycode',
  `latitude` decimal(10,6) NOT NULL COMMENT '绾?害',
  `longitude` decimal(10,6) NOT NULL COMMENT '缁忓害',
  `is_active` tinyint DEFAULT '1' COMMENT '鏄?惁鍚?敤',
  `created_at` datetime DEFAULT CURRENT_TIMESTAMP,
  `updated_at` datetime DEFAULT CURRENT_TIMESTAMP ON UPDATE CURRENT_TIMESTAMP,
  PRIMARY KEY (`id`),
  UNIQUE KEY `uk_city_code` (`city_code`),
  KEY `idx_city_name` (`city_name`),
  KEY `idx_amap_adcode` (`amap_adcode`)
) ENGINE=InnoDB AUTO_INCREMENT=17 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci COMMENT='DWD鍩庡競鍧愭爣琛';
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `dwd_city_location`
--

LOCK TABLES `dwd_city_location` WRITE;
/*!40000 ALTER TABLE `dwd_city_location` DISABLE KEYS */;
INSERT INTO `dwd_city_location` VALUES (1,'BEIJING','北京','北京市','110000','010',39.904200,116.407400,1,'2026-06-08 17:52:40','2026-06-08 17:52:40'),(2,'SHANGHAI','上海','上海市','310000','021',31.230400,121.473700,1,'2026-06-08 17:52:40','2026-06-08 17:52:40'),(3,'GUANGZHOU','广州','广东省','440100','020',23.129100,113.264400,1,'2026-06-08 17:52:40','2026-06-08 17:52:40'),(4,'SHENZHEN','深圳','广东省','440300','0755',22.543100,114.057900,1,'2026-06-08 17:52:40','2026-06-08 17:52:40'),(5,'HANGZHOU','杭州','浙江省','330100','0571',30.274100,120.155100,1,'2026-06-08 17:52:40','2026-06-08 17:52:40'),(6,'NANJING','南京','江苏省','320100','025',32.060300,118.796900,1,'2026-06-08 17:52:40','2026-06-08 17:52:40'),(7,'CHENGDU','成都','四川省','510100','028',30.572800,104.066800,1,'2026-06-08 17:52:40','2026-06-08 17:52:40'),(8,'CHONGQING','重庆','重庆市','500000','023',29.563000,106.551600,1,'2026-06-08 17:52:40','2026-06-08 17:52:40'),(9,'XIAN','西安','陕西省','610100','029',34.341600,108.939800,1,'2026-06-08 17:52:40','2026-06-08 17:52:40'),(10,'WUHAN','武汉','湖北省','420100','027',30.592800,114.305500,1,'2026-06-08 17:52:40','2026-06-08 17:52:40'),(11,'CHANGSHA','长沙','湖南省','430100','0731',28.228200,112.938800,1,'2026-06-08 17:52:40','2026-06-08 17:52:40'),(12,'XIAMEN','厦门','福建省','350200','0592',24.479800,118.089400,1,'2026-06-08 17:52:40','2026-06-08 17:52:40'),(13,'QINGDAO','青岛','山东省','370200','0532',36.067100,120.382600,1,'2026-06-08 17:52:40','2026-06-08 17:52:40'),(14,'KUNMING','昆明','云南省','530100','0871',25.043800,102.710000,1,'2026-06-08 17:52:40','2026-06-08 17:52:40'),(15,'SUZHOU','苏州','江苏省','320500','0512',31.298900,120.585300,1,'2026-06-08 18:31:46','2026-06-08 18:31:46'),(16,'TIANJIN','天津','天津市','120000','022',39.343400,117.361600,1,'2026-06-08 18:31:46','2026-06-08 18:31:46');
/*!40000 ALTER TABLE `dwd_city_location` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `dwd_destination`
--

DROP TABLE IF EXISTS `dwd_destination`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `dwd_destination` (
  `id` bigint unsigned NOT NULL AUTO_INCREMENT,
  `destination_code` varchar(50) NOT NULL,
  `destination_name` varchar(200) NOT NULL,
  `country` varchar(50) DEFAULT '中国',
  `province` varchar(50) DEFAULT NULL,
  `city` varchar(50) DEFAULT NULL,
  `latitude` decimal(10,6) DEFAULT NULL,
  `longitude` decimal(10,6) DEFAULT NULL,
  `destination_type` varchar(50) DEFAULT NULL COMMENT 'nature/culture/adventure/leisure',
  `scenery_score` decimal(5,2) DEFAULT '60.00',
  `popularity_score` decimal(5,2) DEFAULT '60.00',
  `facility_score` decimal(5,2) DEFAULT '60.00',
  `description` text,
  `is_active` tinyint NOT NULL DEFAULT '1',
  `created_at` datetime NOT NULL DEFAULT CURRENT_TIMESTAMP,
  `updated_at` datetime NOT NULL DEFAULT CURRENT_TIMESTAMP ON UPDATE CURRENT_TIMESTAMP,
  `amap_adcode` varchar(20) DEFAULT NULL COMMENT '高德城市/区域adcode',
  `amap_citycode` varchar(20) DEFAULT NULL COMMENT '高德城市citycode',
  PRIMARY KEY (`id`),
  UNIQUE KEY `uk_code` (`destination_code`)
) ENGINE=InnoDB AUTO_INCREMENT=8 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci COMMENT='目的地维表';
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `dwd_destination`
--

LOCK TABLES `dwd_destination` WRITE;
/*!40000 ALTER TABLE `dwd_destination` DISABLE KEYS */;
INSERT INTO `dwd_destination` VALUES (1,'DEST001','张家界国家森林公园','中国','湖南','张家界',29.117000,110.479000,'nature',92.50,85.00,78.00,'阿凡达取景地，石英砂岩峰林地貌，世界自然遗产',1,'2026-06-06 18:44:42','2026-06-08 16:27:30','430800',NULL),(2,'DEST002','西湖','中国','浙江','杭州',30.259000,120.138800,'culture',88.00,95.00,92.00,'UNESCO 世界文化遗产，中国十大风景名胜之一',1,'2026-06-06 18:44:42','2026-06-08 16:27:30','330100',NULL),(3,'DEST003','漓江','中国','广西','桂林',25.274000,110.299000,'nature',90.00,82.00,75.00,'桂林山水甲天下，典型喀斯特地貌水上画廊',1,'2026-06-06 18:44:42','2026-06-08 16:27:30','450300',NULL),(4,'DEST004','布达拉宫','中国','西藏','拉萨',29.660000,91.132000,'culture',95.00,70.00,65.00,'世界上海拔最高的宫殿，藏传佛教圣地',1,'2026-06-06 18:44:42','2026-06-08 16:27:30','540100',NULL),(5,'DEST005','亚龙湾','中国','海南','三亚',18.191000,109.640000,'leisure',85.00,90.00,88.00,'热带海滨度假胜地，碧海蓝天白沙',1,'2026-06-06 18:44:42','2026-06-08 16:27:30','460200',NULL),(6,'DEST006','黄山','中国','安徽','黄山',29.714700,118.338500,'adventure',93.00,80.00,80.00,'五岳归来不看山，黄山归来不看岳',1,'2026-06-06 18:44:42','2026-06-08 16:27:30','341000',NULL),(7,'DEST007','桂林','中国','广西壮族自治区','桂林',25.274200,110.299000,'nature',92.00,75.00,78.00,'山水甲天下',1,'2026-06-08 18:30:58','2026-06-08 18:30:58','450300',NULL);
/*!40000 ALTER TABLE `dwd_destination` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `dwd_hotel_price_detail`
--

DROP TABLE IF EXISTS `dwd_hotel_price_detail`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `dwd_hotel_price_detail` (
  `id` bigint unsigned NOT NULL AUTO_INCREMENT,
  `destination_code` varchar(50) NOT NULL,
  `destination_name` varchar(200) DEFAULT NULL,
  `checkin_date` date NOT NULL,
  `checkout_date` date NOT NULL,
  `hotel_star` tinyint DEFAULT '3',
  `avg_price` decimal(10,2) DEFAULT '300.00',
  `min_price` decimal(10,2) DEFAULT NULL,
  `max_price` decimal(10,2) DEFAULT NULL,
  `hotel_count` int DEFAULT '10',
  `currency` varchar(10) DEFAULT 'CNY',
  `price_level` varchar(20) DEFAULT NULL,
  `data_source` varchar(50) DEFAULT 'model_v3',
  `updated_at` datetime DEFAULT CURRENT_TIMESTAMP ON UPDATE CURRENT_TIMESTAMP,
  `hotel_score` decimal(5,2) DEFAULT '70.00',
  `created_at` datetime NOT NULL DEFAULT CURRENT_TIMESTAMP,
  PRIMARY KEY (`id`),
  KEY `idx_dest_checkin` (`destination_code`,`checkin_date`)
) ENGINE=InnoDB AUTO_INCREMENT=60 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci COMMENT='酒店价格明细';
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `dwd_hotel_price_detail`
--

LOCK TABLES `dwd_hotel_price_detail` WRITE;
/*!40000 ALTER TABLE `dwd_hotel_price_detail` DISABLE KEYS */;
INSERT INTO `dwd_hotel_price_detail` VALUES (31,'DEST001','张家界国家森林公园','2026-07-01','2026-07-05',3,528.00,369.60,792.00,18,'CNY','high','model_v3','2026-06-08 18:21:32',90.45,'2026-06-08 18:21:32'),(32,'DEST002','西湖','2026-07-01','2026-07-05',3,632.00,442.40,948.00,19,'CNY','luxury','model_v3','2026-06-08 18:21:32',99.86,'2026-06-08 18:21:32'),(33,'DEST005','亚龙湾','2026-07-01','2026-07-05',3,768.00,537.60,1152.00,19,'CNY','luxury','model_v3','2026-06-08 18:21:32',86.62,'2026-06-08 18:21:32'),(34,'DEST004','布达拉宫','2026-06-03','2026-06-16',3,555.00,388.50,832.50,17,'CNY','high','model_v3','2026-06-08 18:24:16',85.31,'2026-06-08 18:24:16'),(35,'DEST006','黄山','2026-06-03','2026-06-16',3,460.00,322.00,690.00,18,'CNY','high','model_v3','2026-06-08 18:24:16',87.25,'2026-06-08 18:24:16'),(36,'DEST001','张家界国家森林公园','2026-06-03','2026-06-16',3,528.00,369.60,792.00,18,'CNY','high','model_v3','2026-06-08 18:24:16',89.23,'2026-06-08 18:24:16'),(37,'DEST003','漓江','2026-06-03','2026-06-16',3,519.00,363.30,778.50,18,'CNY','high','model_v3','2026-06-08 18:24:16',89.35,'2026-06-08 18:24:16'),(38,'DEST002','西湖','2026-06-03','2026-06-16',3,632.00,442.40,948.00,19,'CNY','luxury','model_v3','2026-06-08 18:24:16',97.44,'2026-06-08 18:24:16'),(39,'DEST005','亚龙湾','2026-06-03','2026-06-16',3,768.00,537.60,1152.00,19,'CNY','luxury','model_v3','2026-06-08 18:24:16',90.15,'2026-06-08 18:24:16'),(40,'DEST004','布达拉宫','2026-06-11','2026-06-16',3,555.00,388.50,832.50,17,'CNY','high','model_v3','2026-06-08 18:24:45',88.25,'2026-06-08 18:24:45'),(41,'DEST006','黄山','2026-06-11','2026-06-16',3,460.00,322.00,690.00,18,'CNY','high','model_v3','2026-06-08 18:24:45',86.10,'2026-06-08 18:24:45'),(42,'DEST001','张家界国家森林公园','2026-06-11','2026-06-16',3,528.00,369.60,792.00,18,'CNY','high','model_v3','2026-06-08 18:24:45',87.94,'2026-06-08 18:24:45'),(43,'DEST003','漓江','2026-06-11','2026-06-16',3,519.00,363.30,778.50,18,'CNY','high','model_v3','2026-06-08 18:24:45',93.63,'2026-06-08 18:24:45'),(44,'DEST002','西湖','2026-06-11','2026-06-16',3,632.00,442.40,948.00,19,'CNY','luxury','model_v3','2026-06-08 18:24:45',94.63,'2026-06-08 18:24:45'),(45,'DEST005','亚龙湾','2026-06-11','2026-06-16',3,768.00,537.60,1152.00,19,'CNY','luxury','model_v3','2026-06-08 18:24:45',87.01,'2026-06-08 18:24:45'),(46,'DEST004','布达拉宫','2026-06-10','2026-06-16',3,555.00,388.50,832.50,17,'CNY','high','model_v3','2026-06-08 18:32:47',84.53,'2026-06-08 18:32:47'),(47,'DEST006','黄山','2026-06-10','2026-06-16',3,460.00,322.00,690.00,18,'CNY','high','model_v3','2026-06-08 18:32:47',95.22,'2026-06-08 18:32:47'),(48,'DEST001','张家界国家森林公园','2026-06-10','2026-06-16',3,528.00,369.60,792.00,18,'CNY','high','model_v3','2026-06-08 18:32:47',85.69,'2026-06-08 18:32:47'),(49,'DEST007','桂林','2026-06-10','2026-06-16',3,508.00,355.60,762.00,17,'CNY','high','model_v3','2026-06-08 18:32:47',94.70,'2026-06-08 18:32:47'),(50,'DEST003','漓江','2026-06-10','2026-06-16',3,519.00,363.30,778.50,18,'CNY','high','model_v3','2026-06-08 18:32:47',81.84,'2026-06-08 18:32:47'),(51,'DEST002','西湖','2026-06-10','2026-06-16',3,632.00,442.40,948.00,19,'CNY','luxury','model_v3','2026-06-08 18:32:47',90.37,'2026-06-08 18:32:47'),(52,'DEST005','亚龙湾','2026-06-10','2026-06-16',3,768.00,537.60,1152.00,19,'CNY','luxury','model_v3','2026-06-08 18:32:47',86.36,'2026-06-08 18:32:47'),(53,'DEST004','布达拉宫','2026-07-01','2026-07-01',3,555.00,388.50,832.50,17,'CNY','high','model_v3','2026-06-08 18:34:53',89.50,'2026-06-08 18:34:53'),(54,'DEST006','黄山','2026-07-01','2026-07-01',3,460.00,322.00,690.00,18,'CNY','high','model_v3','2026-06-08 18:34:53',86.74,'2026-06-08 18:34:53'),(55,'DEST001','张家界国家森林公园','2026-07-01','2026-07-01',3,528.00,369.60,792.00,18,'CNY','high','model_v3','2026-06-08 18:34:53',85.82,'2026-06-08 18:34:53'),(56,'DEST007','桂林','2026-07-01','2026-07-01',3,508.00,355.60,762.00,17,'CNY','high','model_v3','2026-06-08 18:34:53',85.28,'2026-06-08 18:34:53'),(57,'DEST003','漓江','2026-07-01','2026-07-01',3,519.00,363.30,778.50,18,'CNY','high','model_v3','2026-06-08 18:34:53',82.52,'2026-06-08 18:34:53'),(58,'DEST002','西湖','2026-07-01','2026-07-01',3,632.00,442.40,948.00,19,'CNY','luxury','model_v3','2026-06-08 18:34:53',95.06,'2026-06-08 18:34:53'),(59,'DEST005','亚龙湾','2026-07-01','2026-07-01',3,768.00,537.60,1152.00,19,'CNY','luxury','model_v3','2026-06-08 18:34:53',97.60,'2026-06-08 18:34:53');
/*!40000 ALTER TABLE `dwd_hotel_price_detail` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `dwd_route_detail`
--

DROP TABLE IF EXISTS `dwd_route_detail`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `dwd_route_detail` (
  `id` bigint unsigned NOT NULL AUTO_INCREMENT,
  `origin_city` varchar(50) NOT NULL,
  `destination_code` varchar(50) NOT NULL,
  `destination_name` varchar(200) DEFAULT NULL,
  `travel_date` date NOT NULL,
  `transport_type` varchar(20) DEFAULT 'train' COMMENT 'train/flight/bus',
  `distance_km` decimal(10,2) DEFAULT NULL,
  `traffic_cost` decimal(10,2) DEFAULT '0.00',
  `currency` varchar(10) DEFAULT 'CNY',
  `transfer_count` int DEFAULT '0',
  `duration_minutes` int DEFAULT '0',
  `convenience_score` decimal(5,2) DEFAULT '60.00',
  `data_source` varchar(50) DEFAULT 'amap_route',
  `updated_at` datetime DEFAULT CURRENT_TIMESTAMP ON UPDATE CURRENT_TIMESTAMP,
  `created_at` datetime NOT NULL DEFAULT CURRENT_TIMESTAMP,
  PRIMARY KEY (`id`),
  KEY `idx_origin_date` (`origin_city`,`travel_date`)
) ENGINE=InnoDB AUTO_INCREMENT=55 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci COMMENT='交通路线明细';
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `dwd_route_detail`
--

LOCK TABLES `dwd_route_detail` WRITE;
/*!40000 ALTER TABLE `dwd_route_detail` DISABLE KEYS */;
INSERT INTO `dwd_route_detail` VALUES (29,'上海','DEST001','张家界国家森林公园','2026-07-01','subway+bus',1252.66,793.00,'CNY',1,557,7.17,'amap_route','2026-06-08 18:21:32','2026-06-08 18:21:32'),(30,'上海','DEST002','西湖','2026-07-01','subway',229.77,71.00,'CNY',2,147,65.50,'amap_route','2026-06-08 18:21:32','2026-06-08 18:21:32'),(31,'上海','DEST005','亚龙湾','2026-07-01','subway+bus',2444.98,1094.50,'CNY',6,1867,0.00,'amap_route','2026-06-08 18:21:32','2026-06-08 18:21:32'),(32,'北京','DEST004','布达拉宫','2026-06-03','subway+bus',3521.44,924.00,'CNY',1,2126,0.00,'amap_route','2026-06-08 18:24:16','2026-06-08 18:24:16'),(33,'北京','DEST006','黄山','2026-06-03','subway+bus',1339.72,608.00,'CNY',2,438,17.00,'amap_route','2026-06-08 18:24:16','2026-06-08 18:24:16'),(34,'北京','DEST001','张家界国家森林公园','2026-06-03','subway+bus',1776.25,901.00,'CNY',3,633,0.00,'amap_route','2026-06-08 18:24:16','2026-06-08 18:24:16'),(35,'北京','DEST003','漓江','2026-06-03','subway+bus',2195.86,654.50,'CNY',2,803,0.00,'amap_route','2026-06-08 18:24:16','2026-06-08 18:24:16'),(36,'北京','DEST002','西湖','2026-06-03','subway',1448.95,612.00,'CNY',3,371,18.17,'amap_route','2026-06-08 18:24:16','2026-06-08 18:24:16'),(37,'成都','DEST004','布达拉宫','2026-06-11','subway+bus',1303.97,308.50,'CNY',1,2190,0.00,'amap_route','2026-06-08 18:24:44','2026-06-08 18:24:44'),(38,'成都','DEST006','黄山','2026-06-11','subway+bus',1422.71,968.00,'CNY',2,745,0.00,'amap_route','2026-06-08 18:24:44','2026-06-08 18:24:44'),(39,'成都','DEST001','张家界国家森林公园','2026-06-11','subway+bus',754.11,422.00,'CNY',2,352,31.33,'amap_route','2026-06-08 18:24:44','2026-06-08 18:24:44'),(40,'成都','DEST005','亚龙湾','2026-06-11','subway+bus',1790.03,1021.00,'CNY',4,1771,0.00,'amap_route','2026-06-08 18:24:44','2026-06-08 18:24:44'),(41,'上海','DEST004','布达拉宫','2026-06-10','subway+bus',2997.84,1253.00,'CNY',1,2122,0.00,'amap_route','2026-06-08 18:32:35','2026-06-08 18:32:35'),(42,'上海','DEST006','黄山','2026-06-10','subway+bus',456.14,212.00,'CNY',1,266,55.67,'amap_route','2026-06-08 18:32:35','2026-06-08 18:32:35'),(43,'上海','DEST001','张家界国家森林公园','2026-06-10','subway+bus',1252.66,793.00,'CNY',1,557,7.17,'amap_route','2026-06-08 18:32:35','2026-06-08 18:32:35'),(44,'上海','DEST007','桂林','2026-06-10','subway+bus',1672.24,767.50,'CNY',1,538,10.33,'amap_route','2026-06-08 18:32:35','2026-06-08 18:32:35'),(45,'上海','DEST003','漓江','2026-06-10','subway+bus',1672.26,767.50,'CNY',1,540,10.00,'amap_route','2026-06-08 18:32:35','2026-06-08 18:32:35'),(46,'上海','DEST002','西湖','2026-06-10','subway',229.77,71.00,'CNY',2,147,65.50,'amap_route','2026-06-08 18:32:35','2026-06-08 18:32:35'),(47,'上海','DEST005','亚龙湾','2026-06-10','subway+bus',2444.98,1094.50,'CNY',6,1867,0.00,'amap_route','2026-06-08 18:32:35','2026-06-08 18:32:35'),(48,'北京','DEST004','布达拉宫','2026-07-01','subway+bus',3521.44,924.00,'CNY',1,2126,0.00,'amap_route','2026-06-08 18:34:41','2026-06-08 18:34:41'),(49,'北京','DEST006','黄山','2026-07-01','subway+bus',1339.72,608.00,'CNY',2,438,17.00,'amap_route','2026-06-08 18:34:41','2026-06-08 18:34:41'),(50,'北京','DEST001','张家界国家森林公园','2026-07-01','subway+bus',1776.25,901.00,'CNY',3,633,0.00,'amap_route','2026-06-08 18:34:41','2026-06-08 18:34:41'),(51,'北京','DEST007','桂林','2026-07-01','subway+bus',2195.84,654.50,'CNY',2,802,0.00,'amap_route','2026-06-08 18:34:41','2026-06-08 18:34:41'),(52,'北京','DEST003','漓江','2026-07-01','subway+bus',2195.86,654.50,'CNY',2,803,0.00,'amap_route','2026-06-08 18:34:41','2026-06-08 18:34:41'),(53,'北京','DEST002','西湖','2026-07-01','subway',1448.95,612.00,'CNY',3,371,18.17,'amap_route','2026-06-08 18:34:41','2026-06-08 18:34:41'),(54,'北京','DEST005','亚龙湾','2026-07-01','subway+bus',2968.58,1118.00,'CNY',4,1896,0.00,'amap_route','2026-06-08 18:34:41','2026-06-08 18:34:41');
/*!40000 ALTER TABLE `dwd_route_detail` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `dwd_weather_detail`
--

DROP TABLE IF EXISTS `dwd_weather_detail`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `dwd_weather_detail` (
  `id` bigint unsigned NOT NULL AUTO_INCREMENT,
  `destination_code` varchar(50) NOT NULL,
  `destination_name` varchar(200) DEFAULT NULL,
  `weather_date` date NOT NULL,
  `temp_max` decimal(5,2) DEFAULT NULL,
  `temp_min` decimal(5,2) DEFAULT NULL,
  `precipitation_probability` decimal(5,2) DEFAULT NULL,
  `wind_speed` decimal(5,2) DEFAULT NULL,
  `weather_type` varchar(20) DEFAULT 'sunny' COMMENT 'sunny/cloudy/rainy/snowy',
  `weather_score` decimal(5,2) DEFAULT '70.00',
  `weather_risk_level` varchar(20) DEFAULT NULL,
  `data_source` varchar(50) DEFAULT 'amap_weather',
  `updated_at` datetime DEFAULT CURRENT_TIMESTAMP ON UPDATE CURRENT_TIMESTAMP,
  `created_at` datetime NOT NULL DEFAULT CURRENT_TIMESTAMP,
  PRIMARY KEY (`id`),
  KEY `idx_dest_date` (`destination_code`,`weather_date`)
) ENGINE=InnoDB AUTO_INCREMENT=235 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci COMMENT='天气明细';
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `dwd_weather_detail`
--

LOCK TABLES `dwd_weather_detail` WRITE;
/*!40000 ALTER TABLE `dwd_weather_detail` DISABLE KEYS */;
INSERT INTO `dwd_weather_detail` VALUES (207,'DEST004','布达拉宫','2026-06-08',27.00,14.00,25.00,0.00,'多云',85.00,'low','amap_weather','2026-06-08 18:34:42','2026-06-08 18:34:42'),(208,'DEST004','布达拉宫','2026-06-09',26.00,11.00,25.00,0.00,'多云',85.00,'low','amap_weather','2026-06-08 18:34:42','2026-06-08 18:34:42'),(209,'DEST004','布达拉宫','2026-06-10',25.00,11.00,25.00,0.00,'多云',85.00,'low','amap_weather','2026-06-08 18:34:42','2026-06-08 18:34:42'),(210,'DEST004','布达拉宫','2026-06-11',24.00,11.00,40.00,0.00,'阴',70.00,'low','amap_weather','2026-06-08 18:34:42','2026-06-08 18:34:42'),(211,'DEST006','黄山','2026-06-08',24.00,18.00,70.00,0.00,'小雨',55.00,'medium','amap_weather','2026-06-08 18:34:45','2026-06-08 18:34:45'),(212,'DEST006','黄山','2026-06-09',23.00,16.00,40.00,0.00,'阴',70.00,'low','amap_weather','2026-06-08 18:34:45','2026-06-08 18:34:45'),(213,'DEST006','黄山','2026-06-10',31.00,19.00,5.00,0.00,'晴',95.00,'low','amap_weather','2026-06-08 18:34:45','2026-06-08 18:34:45'),(214,'DEST006','黄山','2026-06-11',33.00,20.00,40.00,0.00,'阴',70.00,'low','amap_weather','2026-06-08 18:34:45','2026-06-08 18:34:45'),(215,'DEST001','张家界国家森林公园','2026-06-08',18.00,16.00,70.00,0.00,'小雨',55.00,'medium','amap_weather','2026-06-08 18:34:46','2026-06-08 18:34:46'),(216,'DEST001','张家界国家森林公园','2026-06-09',25.00,18.00,40.00,0.00,'阴',70.00,'low','amap_weather','2026-06-08 18:34:46','2026-06-08 18:34:46'),(217,'DEST001','张家界国家森林公园','2026-06-10',27.00,20.00,25.00,0.00,'多云',85.00,'low','amap_weather','2026-06-08 18:34:46','2026-06-08 18:34:46'),(218,'DEST001','张家界国家森林公园','2026-06-11',26.00,20.00,70.00,0.00,'小雨',55.00,'medium','amap_weather','2026-06-08 18:34:46','2026-06-08 18:34:46'),(219,'DEST007','桂林','2026-06-08',25.00,20.00,90.00,0.00,'中雨',40.00,'medium','amap_weather','2026-06-08 18:34:47','2026-06-08 18:34:47'),(220,'DEST007','桂林','2026-06-09',26.00,19.00,25.00,0.00,'多云',85.00,'low','amap_weather','2026-06-08 18:34:47','2026-06-08 18:34:47'),(221,'DEST007','桂林','2026-06-10',31.00,21.00,25.00,0.00,'多云',85.00,'low','amap_weather','2026-06-08 18:34:47','2026-06-08 18:34:47'),(222,'DEST007','桂林','2026-06-11',31.00,21.00,25.00,0.00,'多云',85.00,'low','amap_weather','2026-06-08 18:34:47','2026-06-08 18:34:47'),(223,'DEST003','漓江','2026-06-08',25.00,20.00,90.00,0.00,'中雨',40.00,'medium','amap_weather','2026-06-08 18:34:49','2026-06-08 18:34:49'),(224,'DEST003','漓江','2026-06-09',26.00,19.00,25.00,0.00,'多云',85.00,'low','amap_weather','2026-06-08 18:34:49','2026-06-08 18:34:49'),(225,'DEST003','漓江','2026-06-10',31.00,21.00,25.00,0.00,'多云',85.00,'low','amap_weather','2026-06-08 18:34:49','2026-06-08 18:34:49'),(226,'DEST003','漓江','2026-06-11',31.00,21.00,25.00,0.00,'多云',85.00,'low','amap_weather','2026-06-08 18:34:49','2026-06-08 18:34:49'),(227,'DEST002','西湖','2026-06-08',25.00,18.00,25.00,0.00,'多云',85.00,'low','amap_weather','2026-06-08 18:34:50','2026-06-08 18:34:50'),(228,'DEST002','西湖','2026-06-09',25.00,19.00,25.00,0.00,'多云',85.00,'low','amap_weather','2026-06-08 18:34:50','2026-06-08 18:34:50'),(229,'DEST002','西湖','2026-06-10',30.00,21.00,5.00,0.00,'晴',95.00,'low','amap_weather','2026-06-08 18:34:50','2026-06-08 18:34:50'),(230,'DEST002','西湖','2026-06-11',32.00,22.00,25.00,0.00,'多云',85.00,'low','amap_weather','2026-06-08 18:34:50','2026-06-08 18:34:50'),(231,'DEST005','亚龙湾','2026-06-08',33.00,28.00,25.00,28.00,'多云',85.00,'low','amap_weather','2026-06-08 18:34:53','2026-06-08 18:34:53'),(232,'DEST005','亚龙湾','2026-06-09',31.00,25.00,70.00,38.00,'雷阵雨',51.00,'medium-high','amap_weather','2026-06-08 18:34:53','2026-06-08 18:34:53'),(233,'DEST005','亚龙湾','2026-06-10',32.00,25.00,70.00,0.00,'雷阵雨',55.00,'medium-high','amap_weather','2026-06-08 18:34:53','2026-06-08 18:34:53'),(234,'DEST005','亚龙湾','2026-06-11',34.00,26.00,70.00,0.00,'小雨',55.00,'medium','amap_weather','2026-06-08 18:34:53','2026-06-08 18:34:53');
/*!40000 ALTER TABLE `dwd_weather_detail` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `etl_job_log`
--

DROP TABLE IF EXISTS `etl_job_log`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `etl_job_log` (
  `id` bigint NOT NULL AUTO_INCREMENT COMMENT '主键ID',
  `job_name` varchar(100) NOT NULL COMMENT '任务名称',
  `job_type` varchar(50) DEFAULT NULL COMMENT '任务类型',
  `job_desc` varchar(255) DEFAULT NULL COMMENT '任务描述',
  `start_time` datetime NOT NULL COMMENT '任务开始时间',
  `end_time` datetime DEFAULT NULL COMMENT '任务结束时间',
  `status` varchar(20) NOT NULL COMMENT '任务状态：RUNNING/SUCCESS/FAILED',
  `row_count` int DEFAULT '0' COMMENT '处理数据行数',
  `data_date` date DEFAULT NULL COMMENT '任务处理日期',
  `error_message` text COMMENT '错误信息',
  `trigger_type` varchar(50) DEFAULT NULL COMMENT '触发方式：MANUAL/SCHEDULED/API',
  `created_at` datetime DEFAULT CURRENT_TIMESTAMP,
  `updated_at` datetime DEFAULT CURRENT_TIMESTAMP ON UPDATE CURRENT_TIMESTAMP,
  PRIMARY KEY (`id`),
  KEY `idx_job_name` (`job_name`),
  KEY `idx_status` (`status`),
  KEY `idx_start_time` (`start_time`)
) ENGINE=InnoDB AUTO_INCREMENT=53 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci COMMENT='ETL任务运行日志表';
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `etl_job_log`
--

LOCK TABLES `etl_job_log` WRITE;
/*!40000 ALTER TABLE `etl_job_log` DISABLE KEYS */;
INSERT INTO `etl_job_log` VALUES (1,'build_destination_recommend','RECOMMEND','目的地推荐评分计算','2026-06-07 12:58:21','2026-06-07 12:58:22','SUCCESS',18,'2026-07-01',NULL,'API','2026-06-07 12:58:20','2026-06-07 12:58:21'),(2,'build_destination_recommend','RECOMMEND','目的地推荐评分计算','2026-06-07 12:59:44','2026-06-07 12:59:45','SUCCESS',0,'2026-06-03',NULL,'API','2026-06-07 12:59:44','2026-06-07 12:59:45'),(3,'build_destination_recommend','RECOMMEND','目的地推荐评分计算','2026-06-07 13:00:05','2026-06-07 13:00:06','FAILED',0,'2026-07-01','Python 脚本执行异常：Python 推荐计算脚本执行失败，exitCode=1','API','2026-06-07 13:00:04','2026-06-07 13:00:05'),(4,'build_destination_recommend','RECOMMEND','目的地推荐评分计算','2026-06-07 13:00:14','2026-06-07 13:00:15','SUCCESS',0,'2026-04-30',NULL,'API','2026-06-07 13:00:13','2026-06-07 13:00:14'),(5,'build_destination_recommend','RECOMMEND','目的地推荐评分计算','2026-06-07 13:09:45','2026-06-07 13:09:46','SUCCESS',24,'2026-07-01',NULL,'API','2026-06-07 13:09:45','2026-06-07 13:09:46'),(6,'build_destination_recommend','RECOMMEND','目的地推荐评分计算','2026-06-07 13:11:59','2026-06-07 13:12:01','SUCCESS',30,'2026-07-01',NULL,'API','2026-06-07 13:11:59','2026-06-07 13:12:00'),(7,'build_destination_recommend','RECOMMEND','目的地推荐评分计算','2026-06-07 13:12:01','2026-06-07 13:12:02','SUCCESS',0,'2026-08-01',NULL,'API','2026-06-07 13:12:00','2026-06-07 13:12:01'),(8,'build_destination_recommend','RECOMMEND','目的地推荐评分计算','2026-06-07 13:12:25','2026-06-07 13:12:26','SUCCESS',36,'2026-07-01',NULL,'API','2026-06-07 13:12:25','2026-06-07 13:12:26'),(9,'build_destination_recommend','RECOMMEND','目的地推荐评分计算','2026-06-07 13:12:51','2026-06-07 13:12:52','SUCCESS',42,'2026-07-01',NULL,'API','2026-06-07 13:12:51','2026-06-07 13:12:52'),(10,'build_destination_recommend','RECOMMEND','目的地推荐评分计算','2026-06-07 13:13:01','2026-06-07 13:13:02','SUCCESS',0,'2026-08-01',NULL,'API','2026-06-07 13:13:01','2026-06-07 13:13:02'),(11,'collect_weather_amap','COLLECT','高德天气预报数据采集','2026-06-08 16:33:52','2026-06-08 16:33:52','SUCCESS',6,'2026-06-08',NULL,'API','2026-06-08 16:33:51','2026-06-08 16:33:52'),(12,'collect_route_amap','COLLECT','高德公交路径规划数据采集','2026-06-08 16:38:14','2026-06-08 16:38:15','SUCCESS',4,'2026-07-01',NULL,'API','2026-06-08 16:38:14','2026-06-08 16:38:15'),(13,'generate_hotel_price_model','GENERATE','酒店参考价格生成','2026-06-08 16:47:26','2026-06-08 16:47:26','SUCCESS',6,'2026-07-01',NULL,'API','2026-06-08 16:47:25','2026-06-08 16:47:25'),(14,'build_destination_recommend','RECOMMEND','目的地推荐评分计算','2026-06-08 16:51:10','2026-06-08 16:51:12','FAILED',0,'2026-07-01','Python 脚本执行异常：Python 推荐计算脚本执行失败，exitCode=1','API','2026-06-08 16:51:10','2026-06-08 16:51:12'),(15,'build_destination_recommend','RECOMMEND','目的地推荐评分计算','2026-06-08 17:07:31','2026-06-08 17:07:32','FAILED',0,'2026-07-01','Python 脚本执行异常：Python 推荐计算脚本执行失败，exitCode=1','API','2026-06-08 17:07:30','2026-06-08 17:07:32'),(16,'build_destination_recommend','RECOMMEND','目的地推荐评分计算','2026-06-08 17:11:16','2026-06-08 17:11:17','SUCCESS',46,'2026-07-01',NULL,'API','2026-06-08 17:11:16','2026-06-08 17:11:17'),(17,'run_data_quality_check','QUALITY','数据质量规则检查','2026-06-08 17:15:31','2026-06-08 17:15:31','SUCCESS',9,'2026-06-08',NULL,'API','2026-06-08 17:15:30','2026-06-08 17:15:30'),(18,'build_destination_recommend','RECOMMEND','目的地推荐评分计算','2026-06-08 17:31:06','2026-06-08 17:31:07','SUCCESS',0,'2026-06-09',NULL,'API','2026-06-08 17:31:06','2026-06-08 17:31:07'),(19,'build_destination_recommend','RECOMMEND','动态目的地推荐评分计算','2026-06-08 18:14:17','2026-06-08 18:14:38','SUCCESS',6,'2026-07-01',NULL,'API','2026-06-08 18:14:16','2026-06-08 18:14:37'),(20,'collect_route_amap','COLLECT','推荐请求-路线数据采集','2026-06-08 18:14:17','2026-06-08 18:14:26','SUCCESS',6,'2026-07-01',NULL,'API','2026-06-08 18:14:16','2026-06-08 18:14:26'),(21,'collect_weather_amap','COLLECT','推荐请求-天气数据采集','2026-06-08 18:14:26','2026-06-08 18:14:36','SUCCESS',6,'2026-06-08',NULL,'API','2026-06-08 18:14:26','2026-06-08 18:14:36'),(22,'generate_hotel_price_model','GENERATE','推荐请求-酒店价格生成','2026-06-08 18:14:36','2026-06-08 18:14:36','SUCCESS',6,'2026-07-01',NULL,'API','2026-06-08 18:14:36','2026-06-08 18:14:36'),(23,'build_destination_recommend','RECOMMEND','动态目的地推荐评分计算','2026-06-08 18:15:15','2026-06-08 18:15:40','SUCCESS',6,'2026-07-01',NULL,'API','2026-06-08 18:15:14','2026-06-08 18:15:40'),(24,'collect_route_amap','COLLECT','推荐请求-路线数据采集','2026-06-08 18:15:15','2026-06-08 18:15:25','SUCCESS',6,'2026-07-01',NULL,'API','2026-06-08 18:15:14','2026-06-08 18:15:25'),(25,'collect_weather_amap','COLLECT','推荐请求-天气数据采集','2026-06-08 18:15:25','2026-06-08 18:15:39','SUCCESS',6,'2026-06-08',NULL,'API','2026-06-08 18:15:25','2026-06-08 18:15:39'),(26,'generate_hotel_price_model','GENERATE','推荐请求-酒店价格生成','2026-06-08 18:15:39','2026-06-08 18:15:39','SUCCESS',6,'2026-07-01',NULL,'API','2026-06-08 18:15:39','2026-06-08 18:15:39'),(27,'build_destination_recommend','RECOMMEND','动态目的地推荐评分计算','2026-06-08 18:17:30','2026-06-08 18:17:55','SUCCESS',6,'2026-07-01',NULL,'API','2026-06-08 18:17:29','2026-06-08 18:17:54'),(28,'collect_route_amap','COLLECT','推荐请求-路线数据采集','2026-06-08 18:17:30','2026-06-08 18:17:44','SUCCESS',6,'2026-07-01',NULL,'API','2026-06-08 18:17:29','2026-06-08 18:17:43'),(29,'collect_weather_amap','COLLECT','推荐请求-天气数据采集','2026-06-08 18:17:44','2026-06-08 18:17:53','SUCCESS',6,'2026-06-08',NULL,'API','2026-06-08 18:17:43','2026-06-08 18:17:53'),(30,'generate_hotel_price_model','GENERATE','推荐请求-酒店价格生成','2026-06-08 18:17:53','2026-06-08 18:17:53','SUCCESS',6,'2026-07-01',NULL,'API','2026-06-08 18:17:53','2026-06-08 18:17:53'),(31,'build_destination_recommend','RECOMMEND','动态目的地推荐评分计算','2026-06-08 18:21:32','2026-06-08 18:21:34','SUCCESS',3,'2026-07-01',NULL,'API','2026-06-08 18:21:31','2026-06-08 18:21:34'),(32,'collect_route_amap','COLLECT','推荐请求-路线数据采集','2026-06-08 18:21:32','2026-06-08 18:21:33','SUCCESS',3,'2026-07-01',NULL,'API','2026-06-08 18:21:31','2026-06-08 18:21:32'),(33,'collect_weather_amap','COLLECT','推荐请求-天气数据采集','2026-06-08 18:21:33','2026-06-08 18:21:33','SUCCESS',3,'2026-06-08',NULL,'API','2026-06-08 18:21:32','2026-06-08 18:21:32'),(34,'generate_hotel_price_model','GENERATE','推荐请求-酒店价格生成','2026-06-08 18:21:33','2026-06-08 18:21:33','SUCCESS',3,'2026-07-01',NULL,'API','2026-06-08 18:21:32','2026-06-08 18:21:32'),(35,'build_destination_recommend','RECOMMEND','动态目的地推荐评分计算','2026-06-08 18:24:15','2026-06-08 18:24:18','SUCCESS',5,'2026-06-03',NULL,'API','2026-06-08 18:24:14','2026-06-08 18:24:17'),(36,'collect_route_amap','COLLECT','推荐请求-路线数据采集','2026-06-08 18:24:15','2026-06-08 18:24:16','SUCCESS',5,'2026-06-03',NULL,'API','2026-06-08 18:24:14','2026-06-08 18:24:16'),(37,'collect_weather_amap','COLLECT','推荐请求-天气数据采集','2026-06-08 18:24:16','2026-06-08 18:24:17','SUCCESS',6,'2026-06-08',NULL,'API','2026-06-08 18:24:16','2026-06-08 18:24:16'),(38,'generate_hotel_price_model','GENERATE','推荐请求-酒店价格生成','2026-06-08 18:24:17','2026-06-08 18:24:17','SUCCESS',6,'2026-06-03',NULL,'API','2026-06-08 18:24:16','2026-06-08 18:24:16'),(39,'build_destination_recommend','RECOMMEND','动态目的地推荐评分计算','2026-06-08 18:24:44','2026-06-08 18:24:46','SUCCESS',4,'2026-06-11',NULL,'API','2026-06-08 18:24:43','2026-06-08 18:24:46'),(40,'collect_route_amap','COLLECT','推荐请求-路线数据采集','2026-06-08 18:24:44','2026-06-08 18:24:44','SUCCESS',4,'2026-06-11',NULL,'API','2026-06-08 18:24:43','2026-06-08 18:24:44'),(41,'collect_weather_amap','COLLECT','推荐请求-天气数据采集','2026-06-08 18:24:44','2026-06-08 18:24:45','SUCCESS',6,'2026-06-08',NULL,'API','2026-06-08 18:24:44','2026-06-08 18:24:45'),(42,'generate_hotel_price_model','GENERATE','推荐请求-酒店价格生成','2026-06-08 18:24:45','2026-06-08 18:24:45','SUCCESS',6,'2026-06-11',NULL,'API','2026-06-08 18:24:45','2026-06-08 18:24:45'),(43,'collect_weather_amap','COLLECT','高德天气预报数据采集','2026-06-08 18:27:29','2026-06-08 18:27:38','SUCCESS',6,'2026-06-08',NULL,'API','2026-06-08 18:27:29','2026-06-08 18:27:38'),(44,'build_destination_recommend','RECOMMEND','动态目的地推荐评分计算','2026-06-08 18:32:21','2026-06-08 18:32:49','SUCCESS',7,'2026-06-10',NULL,'API','2026-06-08 18:32:21','2026-06-08 18:32:49'),(45,'collect_route_amap','COLLECT','推荐请求-路线数据采集','2026-06-08 18:32:21','2026-06-08 18:32:36','SUCCESS',7,'2026-06-10',NULL,'API','2026-06-08 18:32:21','2026-06-08 18:32:35'),(46,'collect_weather_amap','COLLECT','推荐请求-天气数据采集','2026-06-08 18:32:36','2026-06-08 18:32:48','SUCCESS',7,'2026-06-08',NULL,'API','2026-06-08 18:32:35','2026-06-08 18:32:47'),(47,'generate_hotel_price_model','GENERATE','推荐请求-酒店价格生成','2026-06-08 18:32:48','2026-06-08 18:32:48','SUCCESS',7,'2026-06-10',NULL,'API','2026-06-08 18:32:47','2026-06-08 18:32:47'),(48,'run_data_quality_check','QUALITY','数据质量规则检查','2026-06-08 18:33:34','2026-06-08 18:33:34','SUCCESS',9,'2026-06-08',NULL,'API','2026-06-08 18:33:33','2026-06-08 18:33:33'),(49,'build_destination_recommend','RECOMMEND','动态目的地推荐评分计算','2026-06-08 18:34:24','2026-06-08 18:34:54','SUCCESS',0,'2026-07-01',NULL,'API','2026-06-08 18:34:24','2026-06-08 18:34:54'),(50,'collect_route_amap','COLLECT','推荐请求-路线数据采集','2026-06-08 18:34:24','2026-06-08 18:34:42','SUCCESS',7,'2026-07-01',NULL,'API','2026-06-08 18:34:24','2026-06-08 18:34:41'),(51,'collect_weather_amap','COLLECT','推荐请求-天气数据采集','2026-06-08 18:34:42','2026-06-08 18:34:53','SUCCESS',7,'2026-06-08',NULL,'API','2026-06-08 18:34:41','2026-06-08 18:34:53'),(52,'generate_hotel_price_model','GENERATE','推荐请求-酒店价格生成','2026-06-08 18:34:53','2026-06-08 18:34:53','SUCCESS',7,'2026-07-01',NULL,'API','2026-06-08 18:34:53','2026-06-08 18:34:53');
/*!40000 ALTER TABLE `etl_job_log` ENABLE KEYS */;
UNLOCK TABLES;
/*!40103 SET TIME_ZONE=@OLD_TIME_ZONE */;

/*!40101 SET SQL_MODE=@OLD_SQL_MODE */;
/*!40014 SET FOREIGN_KEY_CHECKS=@OLD_FOREIGN_KEY_CHECKS */;
/*!40014 SET UNIQUE_CHECKS=@OLD_UNIQUE_CHECKS */;
/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
/*!40111 SET SQL_NOTES=@OLD_SQL_NOTES */;

-- Dump completed on 2026-06-19 15:49:49
